/*
 Localizable.strings
 client_ios_fm_a
 
 Created by 杨帆 on 16/2/1.
 Copyright © 2016年 flynn. All rights reserved.
 */
{
    //公用
    "input_capacity_format" = "最多可以输入%ld个字";
    "input_capacity_format_reset" = "当前最多还可以输入%ld个字";
    
    "btn_title_ok" = "确定";
    "btn_title_cancel" = "取消";
    
    "btn_title_i_know" = "知道了";
    "btn_title_no" = "不用,谢谢";
    "btn_title_all_right" = "好的";
    "btn_title_yes" = "是的";
    "btn_title_wait" = "稍等";
    
    "btn_title_current_month" = "%d年%d月";
    "btn_title_current_month_format" = "YYYY年MM月";
    "btn_title_next_month" = "下一月";
    "btn_title_previous_month" = "上一月";
    
    "btn_title_next_item" = "下一项";
    "btn_title_previous_item" = "上一项";
    
    "btn_title_add" = "添加";
    "btn_title_edit" = "修改";
    "btn_title_save" = "保存";
    "btn_title_hold" = "保留";
    "btn_title_finish" = "完成";
    "btn_title_finish_all" = "全部完成";
    
    "btn_title_reset" = "重置";
    "btn_title_upload" = "上传";
    "btn_title_upload_all" = "全部上传";
    "btn_title_delete" = "删除";
    "btn_title_enable" = "启用";
    "btn_title_disable" = "禁用";
    "btn_title_filter" = "筛选";
    "btn_title_submit" = "提交";
    "btn_title_revoke" = "撤销";
    "btn_title_clean" = "清除";
    
    "notice_title_info" = "提示";
    
    "number_one" = "一";
    "number_two" = "二";
    "number_three" = "三";
    "number_four" = "四";
    "number_five" = "五";
    "number_six" = "六";
    "number_seven" = "七";
    "number_eight" = "八";
    "number_nine" = "九";
    "number_ten" = "十";
    
    
    "loading" = "加载中...";
    "load_fail" = "加载失败";
    "requesting" = "请求中...";
    "input_here" = "在此输入数值";
    
    "please_wait" = "功能开发中，敬请期待...";
    
    "no_more_data" = "当前没有更多数据了。";
    
    "photo_count_format" = "共%ld张";
    "audio_count_format" = "共%ld个";
    "cost_submit" = "总计:";
    
    "unknow" = "未知";
    "time_start" = "开始时间";
    "time_end" = "结束时间";
    "time_start_estimate" = "预估开始时间:";
    "time_end_estimate" = "预估结束时间:";
    "time_create" = "创建时间:";
    "time_arrival" = "到达时间";
    "time_completion" = "完成时间";
    
    "yuan" = "元";
    "yuan_symbol" = "￥";
    
    "meter" = "米";
    
    "take_camera" = "拍照";
    "pick_from_album" = "从相册选择";
    
    "label_desc" = "描述:";
    "label_note" = "备注:";
    "start_to_use" = "开始使用";
    "select_no_data" = "当前暂无可选信息";
    "select_no_project" = "当前暂无可选项目";
    
    "year" = "年";
    "month" = "个月";
    
    //weekday
    "sunday" = "日";
    "saturday" = "六";
    "friday" = "五";
    "thursday" = "四";
    "wednesday" = "三";
    "tuesday" = "二";
    "monday" = "一";
    
    //通知
    "notification_need_login" = "收到通知，请登陆之后处理。";
    
    
    
    //登陆页面
    "login_btn_title" = "登录";
    "login_username" = "用户名";
    "login_password" = "密码";
    "login_input_server_address" = "请输入新的服务器地址:";
    "login_server_address_format" = "服务器地址格式有误，请重新输入。";
    "login_fail" = "很抱歉，登陆过程失败。";
    "login_notice_remember_password" = "登陆成功，是否记住密码?";
    "login_notice_request_serverid_failed" = "获取服务器标识信息失败。";
    
    
    //项目切换
    "project_exchange_search_notice" = "请输入项目名(如创新园, cxy)";
    "project_current_key" = "当前";
    "project_current_key_full" = "当前";
    
    //Main
    "tabbar_task" = "任务";
    "tabbar_function" = "工作";
    "tabbar_user" = "我的";
    "tabbar_chart" = "报表";
    "tabbar_me" = "我的";
    "tabbar_messages" = "消息";
    
    //任务
    "task_no_tasks" = "暂无任务";
    "task_view_more" = "查看更多任务";
    
    //功能
    
    "function_order" = "工单";
    "function_order_undo" = "待处理工单";
    "function_order_query" = "工单查询";
    "function_order_dispach" = "待派工工单";
    "function_order_approval" = "待审批工单";
    "function_order_grab" = "待抢工单";
    "function_order_grabed" = "已抢工单";
    "function_order_validate" = "待验证工单";
    "function_order_close" = "待存档工单";
    "function_order_approval_request" = "申请审批";
    
    "function_order_detail_tool" = "工具";
    "function_order_detail_material" = "物料";
    "function_order_detail_equipment" = "设备";
    "function_order_detail_step" = "计划性维护步骤";
    "function_order_detail_cost" = "收费项";
    "function_order_detail_history" = "历史记录";
    
    
    
    "function_patrol" = "巡检";
    "function_patrol_task" = "巡检任务";
    "function_patrol_query" = "巡检查询";
    "function_patrol_record_edit" = "记录填写";
    "function_patrol_scanner" = "扫一扫";
    "function_patrol_spot_list" = "点位任务列表";
    
    
    "patrol_notice_no_tasks" = "当前点位没有巡检任务";
    "patrol_notice_spot_error" = "点位编码错误";
    
    
    
    
    "function_maintenance" = "计划性维护";
    "function_asset" = "资产";
    "function_report" = "报障";
    "function_report_detail" = "报障详情";
    "function_report_un_uploaded" = "未上传";
    "function_report_uploaded" = "提交";
    "function_reset_password" = "重置密码";
    "function_outline_download" = "离线数据下载";
    "function_setting_feedback" = "意见反馈";
    "function_setting_about" = "关于";
    "function_setting_legal" = "法律声明";
    "function_bind_phone" = "绑定手机号";
    "function_chart" = "报表";
    "function_emergency" = "紧急事件";
    "function_due_remind" = "到期提醒";
    "function_info_select" = "选择";
    "function_info_select_laborer" = "执行人";
    "function_info_select_approver" = "审批人";
    "function_info_select_location" = "位置";
    "function_info_select_department" = "部门";
    "function_info_select_service_type" = "服务类型";
    "function_info_select_order_type" = "工单类型";
    "function_info_select_priority" = "优先级";
    "function_info_select_equipment" = "设备";
    "function_info_select_inventory" = "仓库";
    "function_info_select_material" = "物料";
    "function_info_select_requirement" = "需求类型";
    "function_info_select_title_material" = "物料选择";
    
    "function_select_project" = "项目选择";
    
    "function_qrcode" = "二维码扫描";
    
    "function_attendance" = "在岗管理";
    
    
    
    "function_requirement" = "服务台";
    //    "function_inventory" = "库存";
    "function_library" = "知识库";
    "function_energy" = "能源";
    "function_energy_second_title" = "能源管理";
    
    "function_setting" = "设置";
    "function_setting_cache" = "清除缓存";
    "function_setting_notification" = "消息通知";
    "function_notification_alert" = "接收消息通知";
    
    "function_my_report" = "我的报障";
    "function_my_requirement" = "我的需求";
    "function_requirement_create" = "创建新需求";
    "function_requirement_approval" = "待审批需求";
    "function_requirement_undo" = "待处理需求";
    "function_requirement_evaluate" = "待评价需求";
    "function_requirement_query" = "需求查询";
    "function_requirement_detail" = "需求详情";
    "function_requirement_content" = "处理内容填写";
    "function_requirement_detail_evaluate" = "需求评价";
    
    "function_requirement_history" = "需求查询";
    
    "function_video_create" = "视频录制";
    "function_media_play" = "视频播放";
    
    "function_inventory" = "库存";
    "function_inventory_reserve" = "物资预定";
    "function_inventory_reserved" = "我的预定";
    "function_inventory_approval" = "库存审核";
    "function_inventory_history" = "库存查询";
    
    "function_inventory_storage_in" = "入库";
    "function_inventory_storage_out" = "出库";
    "function_inventory_storage_move" = "移库";
    "function_inventory_storage_count" = "盘点";
    
    
    
    "function_inventory_reserve_detail" = "预定详情";
    "function_inventory_material" = "物料";
    "function_inventory_delivery_material_detail" = "出库物资调整";
    "function_inventory_reserve_material_detail" = "预定物料";
    "function_inventory_move_material_detail" = "移库物料";
    "function_inventory_select_provider" = "供应商选择";
    
    "function_notice" = "公告";
    
    "function_contract" = "合同";
    "function_contract_process" = "合同管理";
    "function_contract_query" = "合同查询";
    "function_contract_detail" = "合同详情";
    "function_contract_statistics" = "合同统计";
    
    //我的
    "user_telno" = "手机号";
    "user_my_attendance_record" = "我的签到记录";
    "user_my_qrcode" = "我的二维码";
    "user_reset_password" = "重置密码";
    "user_outline_download" = "离线下载";
    "user_feedback" = "反馈";
    "user_about" = "关于";
    "user_logout" = "退出登录";
    "user_logout_notice" = "是否退出登录?";
    "user_btn_logout" = "退出";
    
    //消息
    "message_no_data" = "暂无消息记录";
    "message_time_format_morning" = "上午%@%ld:%@%ld";
    "message_time_format_afternoon" = "下午%@%ld:%@%ld";
    "message_time_format_24" = "%@%ld:%@%ld";
    "message_yestarday" = "昨天";
    "message_tomorrow" = "明天";
    "message_date_format" = "%ld月%ld日";
    
    "fast_scan_spot" = "点位扫描";
    "fast_scan_equipment" = "设备扫描";
    
    //工作
    "main_notice_no_function" = "暂无模块权限";
    
    //巡检
    "patrol_no_tasks" = "当前点位暂无巡检任务。";
    "patrol_spot_qrcode_error" = "点位编码错误。";
    "patrol_submit_success" = "数据上传成功。";
    "patrol_submit_fail" = "数据上传失败。";
    "patrol_notice_unfinished_some" = "你还有%d个检查项未做，是否提交?";
    "patrol_notice_unfinished" = "你有巡检点位处于未完成状态，是否提交?";
    "patrol_task" = "巡检任务";
    "patrol_request_fail" = "获取数据出错";
    "patrol_no_task_current" = "暂无巡检任务";
    "patrol_btn_submit" = "提交";
    "patrol_load_fail" = "任务加载失败。";
    
    "patrol_btn_all" = "全部";
    "patrol_btn_finished" = "完成";
    "patrol_btn_unfinished" = "未完成";
    "patrol_menu_syn" = "同步";
    "patrol_no_data_syn" = "当前没有需要同步的数据。";
    "patrol_no_spot" = "当前没有点位。";
    "patrol_no_spot_finished" = "当前没有已完成的点位。";
    "patrol_no_spot_unfinished" = "当前没有未完成的点位。";
    
    "patrol_query" = "巡检查询";
    "patrol_no_history" = "暂无历史巡检记录。";
    
    "patrol_filter_name" = "巡检名称";
    "patrol_filter_name_placeholder" = "请输入巡检名称";
    "patrol_filter_time_start" = "巡检开始时间";
    "patrol_filter_time_end" = "巡检结束时间";
    "patrol_filter_spot_status" = "点位状态";
    "patrol_status_normal" = "正常";
    "patrol_status_exception" = "异常";
    "patrol_status_leak" = "漏检";
    "patrol_status_report" = "报修";
    "patrol_status_fillup" = "补检";
    "patrol_time_start_behind_end" = "结束时间早于开始时间，请注意。";
    
    "patrol_status_exception_processed" = "已处理";
    
    "patrol_detail" = "巡检详情";
    "patrol_comprehensive" = "综合巡检";
    "patrol_spot" = "点位:";
    "patrol_spot_content" = "巡检内容";
    "patrol_device_info" = "设备信息";
    "patrol_order_list" = "工单列表";
    "patrol_notice_report" = "你想现在报修吗?";
    "patrol_notice_syned_success" = "数据同步成功。";
    "patrol_notice_syned_fail" = "数据同步失败。";
    "patrol_notice_qrcode_fail" = "点位匹配出错，请确认点位。";
    "patrol_spot_content_amount" = "检查项:";
    "patrol_spot_amount" = "%d个点位";
    "patrol_comprehensive_amount" = "综合:";
    
    "patrol_spot_location" = "位置:";
    
    "patrol_comprehensive_amount_format" = "%ld项";
    
    "patrol_device" = "点位设备";
    "patrol_equipment_amount" = "设备:";
    "patrol_equipment_amount_foramt" = "%ld个";
    "patrol_equipment_name" = "设备名称:";
    "patrol_equipment_system" = "所属系统:";
    "patrol_equipment_mark_stop" = "停机";
    "patrol_equipment_mark_normal" = "正常";
    "patrol_notice_equipment_status_exception_format" = "设备处于%@状态，不用进行巡检。";
    "patrol_notice_equipment_status_exception_stop" = "设备已停机。";
    
    "patrol_equipment_status_operate_placeholder" = "是否停机";
    "patrol_equipment_status_idle" = "闲置";
    "patrol_equipment_status_stop" = "停用";
    "patrol_equipment_status_using" = "使用中";
    "patrol_equipment_status_repairing" = "维修中";
    "patrol_equipment_status_scrap" = "报废";
    "patrol_equipment_status_lock" = "已封存";
    "patrol_equipment_status_scraping" = "待报废";
    
    "patrol_task_status_begin" = "未开始";
    "patrol_task_status_in_progress" = "进行中";
    "patrol_task_status_complete" = "已完成";
    "patrol_task_status_incomplete" = "未完成";
    "patrol_task_status_delay" = "延期完成";
    
    
    "patrol_spot_not_begin" = "未开始";
    "patrol_spot_normal" = "已完成";
    "patrol_spot_exception" = "异常";
    "patrol_spot_not_finish" = "未完成";
    
    "patrol_content_spot" = "点位:";
    "patrol_content_device" = "设备:";
    
    "patrol_syned" = "已同步";
    "patrol_un_syned" = "未同步";
    "patrol_laborer" = "巡检人员:";
    "patrol_cycle" = "巡检周期:";
    "patrol_time_estimate" = "计划时间:";
    "patrol_time_reality" = "实际时间:";
    
    
    "patrol_content_result" = "巡检结果:";
    "patrol_check_result" = "检查结果:";
    "patrol_content_desc" = "故障描述:";
    "patrol_question_desc" = "问题描述";
    "patrol_relation_photos" = "相关照片";
    
    "patrol_exception_common" = "常见异常";
    "patrol_exception_place_holder" = "请输入您的记录";
    "patrol_exception_no_data" = "无常见异常";
    "patrol_exception_input_notice" = "请输入您的记录~";
    
    "patrol_item_operate" = "处理";
    "patrol_item_operate_report" = "报修";
    "patrol_item_operate_mark" = "标记为已处理";
    "patrol_item_operate_success" = "请求成功。";
    "patrol_item_operate_fail" = "请求失败";
    
    "patrol_task_type_inspection" = "巡检";
    "patrol_task_type_patrol" = "巡视";
    
    
    //工单
    "order_laborer_added" = "该执行人已经被添加。";
    "order_approver_added" = "已经被添加。";
    "order_time_start_behind_end" = "完成时间早于开始时间，请注意。";
    "order_receive_success" = "接单成功。";
    "order_receive_fail" = "接单失败。";
    "order_continue_success" = "继续工作成功。";
    "order_continue_fail" = "继续工作失败。";
    "order_approval_success" = "审批提交成功。";
    "order_approval_fail" = "审批提交失败。";
    "order_grab_success" = "请求提交成功。";
    "order_grab_fail" = "请求提交失败。";
    "order_designate_principal" = "请先选择一个负责人。";
    "order_laborer_empty" = "请先添加执行人";
    
    
    "order_designate_approver" = "请先选择一个审批人。";
    "order_designate_arrive_time" = "请先设定预估到达时间。";
    "order_dispach_success" = "工单分派成功。";
    "order_dispach_fail" = "工单分派失败。";
    "order_terminate_success" = "工单终止成功。";
    "order_terminate_fail" = "工单终止失败。";
    "order_back_success" = "退单成功。";
    "order_back_fail" = "退单失败。";
    "order_pause_success" = "工单暂停成功。";
    "order_pause_fail" = "工单暂停失败。";
    "order_save_success" = "数据保存成功。";
    "order_save_fail" = "数据保存失败。";
    "order_finish_success" = "处理完成成功。";
    "order_finish_fail" = "处理完成失败。";
    "order_validate_success" = "工单验证成功。";
    "order_validate_fail" = "工单验证失败。";
    "order_close_success" = "工单存档成功。";
    "order_close_fail" = "工单存档失败。";
    "order_request_approval_success" = "提交审批申请成功。";
    "order_request_approval_fail" = "提交审批申请失败。";
    
    "order_estimate_arrive_time" = "预估到达时间:";
    "order_estimate_time" = "预估时间:";
    "order_reserve_time" = "预约时间:";
    "order_score" = "积分:";
    "order_grab_laborer_grabed" = "已抢";
    "order_grab_laborer_ungrabed" = "未抢";
    "order_charge" = "收费项";
    "order_charge_name" = "收费项";
    "order_charge_name_placeholder" = "请输入收费项名称";
    "order_charge_amount" = "费用";
    "order_charge_amount_placeholder" = "请输入费用";
    
    "order_sign" = "签字";
    "order_sign_customer" = "客户签字";
    "order_sign_supervisor" = "主管签字";
    "order_sign_finished" = "已签";
    
    "order_code" = "工单号";
    "order_laborer" = "执行人";
    "order_location" = "位置";
    
    "order_no_data" = "暂无工单";
    "order_undo_no_data" = "暂无待处理工单";
    "order_dispach_no_data" = "暂无待派工工单";
    "order_approval_no_data" = "暂无待审批工单";
    "order_validate_no_data" = "暂无待验证工单";
    "order_close_no_data" = "暂无待存档工单";
    "order_grab_no_data" = "暂无可抢工单";
    "order_grabed_no_data" = "暂无已抢工单";
    
    "order_time_used" = "%.1f小时";
    "order_filter_time_used" = "耗时(小时):";
    
    "order_detail_common_time_reserve" = "预约时间:";
    "order_detail_common_time_estimate" = "预估时间:";
    "order_detail_common_location" = "位置:";
    "order_detail_common_desc" = "描述:";
    "order_detail_common_org" = "部门:";
    "order_detail_common_serviceType" = "服务类型:";
    "order_detail_common_pfmcode" = "PFM编码:";
    
    "order_status_create" = "已创建";
    "order_status_dispached" = "已派工";
    "order_status_process" = "处理中";
    "order_status_stop" = "已暂停";
    "order_status_teminate" = "已终止";
    "order_status_finish" = "已完成";
    "order_status_validation" = "已验证";
    "order_status_close" = "已存档";
    "order_status_approve" = "待审批";
    "order_status_delayed_finished" = "延期完成";
    "order_status_discard" = "已作废";
    
    "order_grab_status_untook" = "未抢";
    "order_grab_status_approve" = "审核中";
    "order_grab_status_success" = "抢单成功";
    "order_grab_status_fail" = "抢单失败";
    
    "order_step_create" = "创建";
    "order_step_dispach" = "派工";
    "order_step_receive" = "接单";
    "order_step_update" = "更新";
    "order_step_stop" = "暂停";
    "order_step_terminate" = "终止";
    "order_step_finish" = "完成";
    "order_step_validate" = "验证";
    "order_step_close" = "关闭";
    "order_step_approval_request" = "申请审批";
    "order_step_approval" = "批准申请";
    "order_step_escalation" = "工单升级";
    "order_step_continue" = "继续";
    "order_step_reject" = "退单";
    
    "order_laborer_status_un_accept" = "未接单";
    "order_laborer_status_accept" = "已接单";
    "order_laborer_status_back" = "已退单";
    "order_laborer_status_submit" = "已提交";
    
    "order_equipment_repqir_type_repair" = "维修";
    "order_equipment_repqir_type_rectify" = "整改";
    "order_equipment_repqir_type_replace" = "更换";
    
    "order_menu_save" = "保存";
    "order_menu_finish" = "完成";
    "order_menu_evaluate" = "评价";
    "order_menu_process" = "处理";
    
    "order_approval_problem" = "审批事由";
    "order_approval_reason_placeholder" = "请输入审批事由";
    "order_approval_reason_input_max" = "最多可以输入%ld个字";
    "order_approval_person" = "审批人";
    
    "order_approval_type" = "审批类型";
    "order_approval_content" = "审批内容";
    "order_base_info" = "基本信息";
    "order_work_content" = "工作内容";
    "order_work_history" = "工作历史";
    "order_equipment" = "故障设备";
    "order_failure_reason" = "故障原因";
    "order_tool" = "工具";
    "order_planned_step" = "维护步骤";
    "order_step" = "历史记录";
    "order_material" = "物料";
    "order_attachment" = "附件";
    "order_related_order" = "关联工单";
    
    "order_work_content_notice" = "请输入内容";
    "order_work_content_edit" = "填写工作内容";
    
    
    "order_tool_name" = "名称";
    "order_tool_amount" = "数量";
    "order_tool_unit" = "单位";
    "order_tool_cost" = "费用(单价)";
    "order_tool_desc" = "备注";
    "order_tool_brand" = "品牌";
    "order_tool_model" = "型号";
    "order_tool_name_placeholder" = "请输入名称";
    "order_tool_amount_placeholder" = "请输入数量";
    "order_tool_unit_placeholder" = "请输入单位";
    "order_tool_cost_placeholder" = "请输入费用 (￥)";
    "order_tool_desc_placeholder" = "请输入备注";
    "order_tool_brand_placeholder" = "请输入品牌";
    "order_tool_model_placeholder" = "请输入型号";
    "order_tool_no_data" = "暂无数据";
    
    "order_tool_notice_name_empty" = "名称不能为空。";
    "order_tool_notice_amount_empty" = "数量不能为空。";
    "order_tool_notice_unit_empty" = "单位不能为空。";
    "order_tool_notice_cost_empty" = "请填写工具费用";
    
    
    
    "order_tool_add" = "添加工具";
    "order_tool_edit" = "编辑工具";
    
    "order_charge_add" = "添加收费项";
    "order_charge_edit" = "修改收费项";
    
    "order_select_failure_reason" = "选择故障原因";
    
    
    "order_equipment_add" = "添加设备";
    "order_equipment_edit" = "编辑设备";
    
    "order_equipment_name" = "设备名称";
    "order_equipment_name_placeholder" = "点击选择设备";
    "order_equipment_status" = "设备状态";
    "order_equipment_status_placeholder" = "点击选择设备状态";
    "order_equipment_repair_type" = "维修类型";
    "order_equipment_repair_type_placeholder" = "点击选择维修类型";
    "order_equipment_code" = "设备编码";
    "order_equipment_code_placeholder" = "点击选择设备";
    "order_equipment_system" = "设备分类";
    "order_equipment_desc" = "故障描述";
    "order_equipment_desc_placeholder" = "请输入故障描述";
    "order_equipment_repair" = "维修描述";
    "order_equipment_repair_placeholder" = "请输入维修方式";
    "order_equipment_location" = "设备位置";
    "order_equipment_no_data" = "暂无故障设备";
    "order_equipment_notice_empty" = "请先选择一个设备。";
    "order_equipment_status_finished" = "已完成";
    "order_equipment_status_unfinished" = "未完成";
    "order_equipment_qrcode_error" = "二维码不匹配。";
    
    "order_equipment_header_core" = "核心组件";
    
    
    "order_equipment_edit_success" = "数据提交成功。";
    "order_equipment_edit_fail" = "数据提交失败。";
    "order_equipment_delete_success" = "数据删除成功。";
    "order_equipment_delete_fail" = "数据删除成功。";
    
    "order_equipment_repairtype_none" = "不需要维修";
    "order_equipment_repairtype_repair" = "维修";
    "order_equipment_repairtype_rectify" = "整改";
    "order_equipment_repairtype_exchange" = "更换";
    
    
    "order_notice_equipment_exception_status_stop" = "当前设备处于已停机状态，不用参与巡检。";
    "order_notice_equipment_process_format" = "你还有%ld个设备未完成维保，是否提交，请确认。";
    
    "order_record_code" = "编号:";
    "order_record_time" = "时间:";
    "order_record_person" = "处理人:";
    "order_record_step" = "处理步骤:";
    "order_record_content" = "处理内容:";
    
    
    
    "order_btn_add" = "添加";
    "order_btn_edit" = "修改";
    "order_btn_reserve" = "预定";
    
    "order_warehouse_name" = "仓库名称";
    "order_warehouse_name_placeholder" = "点击选择仓库";
    "order_material_add" = "添加物料";
    "order_material_edit" = "编辑物料";
    "order_material_list" = "物料列表:";
    "order_notice_reserve_amount" = "请先设置预定数量。";
    "order_notice_reserve" = "请先至少选择一种物料。";
    "order_notice_warehouse" = "请先选择一个仓库。";
    "order_notice_no_bat" = "当前没有可选批次。";
    "order_notice_more_than_inventory" = "数量超过库存总量，选择失败。";
    "order_notice_more_than_batch" = "数量超过批次总量，选择失败。";
    "order_notice_material_exist" = "物料已存在。";
    "order_notice_material_amount_error" = "预定数量不能为空或者负数，请确认。";
    "order_notice_someone_unreceive" = "存在其它执行人尚未接单，无法终止工单。";
    "order_notice_reservation_handler_empty" = "物料预定单信息不完整，是否使用默认值？";
    "order_alert_delete_material" = "是否删除该物料,请选择。";
    
    "order_notice_delete_approver" = "是否删除该审批人,请选择。";
    "order_notice_delete_worker" = "是否删除该执行人,请选择。";
    "order_notice_delete_equipment" = "是否删除该设备,请选择。";
    
    "order_material_reserve_success" = "物料预定成功。";
    "order_material_update_success" = "物料修改成功。";
    "order_material_reserve_fail" = "物料预定失败。";
    "order_material_operation_fail" = "操作失败。";
    "order_notice_equipment_exist" = "设备已存在。";
    
    "order_material_name" = "名称:";
    
    
    "order_material_brand" = "品牌:";
    "order_material_model" = "型号:";
    "order_material_unit" = "单位:";
    "order_material_amount" = "数量:";
    "order_material_inventory_amount" = "库存量:";
    "order_material_over_due" = "过期时间:";
    "order_material_reserve_amount" = "预定数量:";
    
    
    "order_material_name_placeholder" = "点击选择物料";
    "order_material_brand_placeholder" = "品牌";
    "order_material_model_placeholder" = "型号";
    "order_material_inventory_quantity_placeholder" = "库存量";
    "order_material_reserve_quantity_placeholder" = "预定数量";
    
    "order_material_no_data" = "暂无数据";
    
    "order_step_number" = "序号:";
    "order_step_step" = "步骤";
    "order_step_workTeam" = "工作组";
    "order_step_work_desc" = "描述";
    "order_step_is_finish" = "是否完成";
    "order_step_finish_yes" = "已完成";
    "order_step_finish_no" = "未完成";
    
    "order_evaluate_timeliness" = "及时性:";
    "order_evaluate_service" = "服务质量:";
    "order_evaluate_work" = "工作质量:";
    "order_evaluate_option" = "请输入评论:";
    "order_evaluate_score" = "评分";
    
    "order_notice_call_fail_telno" = "号码格式有误，拨打失败。";
    
    "order_time_setting" = "%@工作时间";
    "order_time_picker" = "日期选择";
    "order_time_arrive_reality" = "实际到场时间";
    "order_time_finish_reality" = "实际完成时间";
    
    "order_content_edit" = "工作内容填写";
    "order_switch_finish" = "是否完成:";
    "order_step_edit" = "计划步骤填写";
    "order_history_no_data" = "暂无符合条件的历史工单记录";
    
    "order_priority" = "优先级";
    "order_filter_status" = "工单状态";
    "order_filter_location_label" = "位置";
    "order_filter_location" = "安装位置:";
    "order_detail" = "工单详情";
    
    "order_detail_create_desc" = "%@创建于%@";
    "order_detail_expand" = "展开";
    "order_detail_unexpand" = "收起";
    
    "order_operation_terminate" = "终止";
    "order_operation_dispach" = "派工";
    "order_operation_approval" = "审批";
    "order_operation_approval_request" = "审批申请";
    "order_operation_save" = "保存";
    "order_operation_back" = "退单";
    "order_operation_pause" = "暂停";
    "order_operation_finish" = "处理完成";
    "order_operation_receive" = "接单";
    "order_operation_continue" = "继续工作";
    "order_operation_un_continue" = "不继续工作";
    "order_operation_refuse" = "拒绝";
    "order_operation_pass" = "通过";
    "order_operation_assign" = "发布";
    "order_operation_handle" = "处理";
    "order_operation_grab" = "抢单";
    "order_operation_validate" = "验证";
    "order_operation_validate_pass" = "通过";
    "order_operation_validate_refuse" = "拒绝";
    "order_operation_close" = "存档";
    "order_back_reason" = "退单原因";
    "order_terminate_reason" = "终止原因";
    "order_approval_reason" = "审批意见";
    "order_pause_reason" = "暂停原因";
    "order_workorder" = "工单";
    "order_approval_desc" = "审批说明";
    "order_validate_desc" = "请输入描述";
    
    "order_alert_title_back" = "退回工单";
    "order_alert_title_pause" = "暂停工单";
    "order_alert_title_terminate" = "终止工单";
    "order_alert_title_finish" = "完成工单";
    "order_alert_title_approval" = "审批工单";
    "order_alert_title_validate" = "验证工单";
    
    "order_laborer_name" = "执行人:";
    "order_laborer_position" = "岗位:";
    "order_laborer_contact" = "联系方式:";
    "order_laborer_time" = "工作时间:";
    "order_laborer_responsible" = "负责人";
    "order_laborer_time_arrive" = "到场时间:";
    "order_laborer_time_finish" = "完成时间:";
    "order_laborer_responsible" = "负责人";
    "order_work_content_placeholder" = "请输入工作内容描述";
    
    "order_laborer_add" = "添加执行人";
    "order_laborer_estimate" = "预计工作时间";
    "order_laborer_estimate_time_start" = "预计开始时间";
    "order_laborer_estimate_time_end" = "预计结束时间";
    "order_laborer_responsible_desc" = "选中的是负责人";
    "order_approver_add" = "添加审批人";
    "order_approver" = "审批人";
    
    "order_cost_tool" = "工具费用";
    "order_cost_material" = "物料费用";
    "order_charge_edit_notice_material" = "工具费用需要在工具详情中修改。";
    "order_charge_notice_empty_name" = "收费项不能为空。";
    "order_charge_notice_empty_amount" = "费用不能为空。";
    
    "order_equipment_component_replace" = "核心组件更换";
    "order_equipment_component_operation_replace" = "更换";
    "order_equipment_component_notice_code_empty" = "编号不能为空";
    "order_equipment_component_notice_name_empty" = "名称不能为空";
    "asset_core_component_code" = "编码";
    "asset_core_component_code_placeholder" = "请输入编码";
    "asset_core_component_name" = "名称";
    "asset_core_component_name_placeholder" = "请输入名称";
    "asset_core_component_brand" = "品牌";
    "asset_core_component_brand_placeholder" = "请输入品牌";
    "asset_core_component_model" = "型号";
    "asset_core_component_model_placeholder" = "请输入型号";
    "asset_core_component_period" = "质保期";
    "asset_core_component_period_desc" = "(单位:月)";
    "asset_core_component_period_placeholder" = "请输入质保期";
    "asset_core_component_install_date" = "安装日期";
    "asset_core_component_install_date_placeholder" = "请选择安装日期";
    "asset_core_component_expired_date" = "质保日期";
    "asset_core_component_expired_date_placeholder" = "请选择质保日期";
    
    //计划性维护
    "maintenance_message_title" = "PPM";
    "maintenance_task_desc" = "个任务";
    "maintenance_task_desc_multi" = "个任务";
    "maintenance_task_month" = "%ld年%ld月任务";
    "maintenance_finished" = "已完成";
    "maintenance_leak" = "遗漏";
    "maintenance_not_begin" = "未开始";
    "maintenance_process" = "处理中";
    "maintenance_notice_no_order" = "暂无维护工单";
    "maintenance_work_group" = "工作组:";
    "maintenance_cycle" = "周期:";
    "maintenance_first_time" = "首次维护时间:";
    "maintenance_next_time" = "下次维护时间:";
    "maintenance_used_time" = "耗时:";
    "maintenance_auto_order" = "自动生成工单:";
    "maintenance_auto_order_yes" = "是";
    "maintenance_auto_order_no" = "否";
    "maintenance_day_shift" = "提前天数:";
    "maintenance_equipment" = "维护设备";
    "maintenance_location" = "空间位置";
    "maintenance_name" = "维保名称:";
    "maintenance_important" = "重要";
    "maintenance_effect" = "影响:";
    "maintenance_base_info" = "基本信息";
    "maintenance_step" = "步骤";
    "maintenance_attachment" = "附件";
    "maintenance_material" = "物料";
    "maintenance_tool" = "工具";
    "maintenance_content" = "维护内容";
    "maintenance_content_colon" = "维护内容:";
    "maintenance_target" = "对象";
    "maintenance_order" = "维护工单";
    "maintenance_day" = "天";
    "maintenance_day_multi" = "天";
    "maintenance_detail" = "计划性维护详情";
    "maintenance_notice_request_calendar_fail" = "获取计划性维护日历失败。";
    
    //设备台账
    "asset_status_idle" = "闲置";
    "asset_status_stop" = "停用";
    "asset_status_using" = "使用";
    "asset_status_repairing" = "维修中";
    "asset_status_scraping" = "待报废";
    "asset_status_discard" = "报废";
    "asset_status_lock" = "封存";
    
    
    "asset_code" = "设备编码:";
    "asset_base_info" = "基本信息";
    "asset_parameter_info" = "参数信息";
    "asset_base_info_placeholder" = "名称/品牌/型号";
    "asset_location" = "安装位置:";
    "asset_system" = "系统分类:";
    "asset_qrcode_error" = "设备编码错误。";
    "asset_qrcode_exist" = "设备已存在。";
    "asset_repair" = "维修";
    "asset_maintenance" = "维保";
    "asset_no_data" = "暂无满足条件的设备台账记录";
    "asset_qrcode_pair_fail" = "匹配失败";
    "asset_detail" = "设备台账详情";
    "asset_detail_no_data" = "暂无设备台账详情信息";
    "asset_photo" = "图片";
    
    "asset_equipment_info" = "设备信息";
    "asset_factory_info" = "厂家信息";
    "asset_contract_info" = "合同信息";
    "asset_repair_record" = "维修记录";
    "asset_maintenance_record" = "维保记录";
    
    "asset_maintenance_no_data" = "暂无维保记录信息";
    "asset_repair_no_data" = "暂无维修记录信息";
    "asset_contract_no_data" = "暂无合同信息";
    "asset_factory_no_data" = "暂无厂家信息";
    
    "asset_contract_repair" = "维修合同";
    "asset_contract_maintenance" = "维保合同";
    "asset_contract_other" = "其它合同";
    
    "asset_factory_product" = "生产商";
    "asset_factory_supply" = "供应商";
    "asset_factory_install" = "安装单位";
    
    "asset_service_area" = "服务区域:";
    "asset_service_target" = "服务对象:";
    
    "asset_contract_code" = "合同编号";
    "asset_contract_unit" = "保修单位";
    "asset_contract_time_start" = "开始时间";
    "asset_contract_time_end" = "结束时间";
    "asset_contract_cost" = "合同金额";
    "asset_contract_desc" = "合同简介";
    
    "asset_factory_contact" = "联系人";
    "asset_factory_telno" = "电话";
    "asset_factory_address" = "地址";
    
    "asset_equipment_name" = "设备名称";
    "asset_equipment_code" = "设备编号";
    "asset_equipment_location" = "安装位置";
    "asset_equipment_system" = "系统分类";
    "asset_equipment_status" = "设备状态";
    "asset_equipment_repairtype" = "维修类型";
    "asset_equipment_brand" = "品牌";
    "asset_equipment_model" = "型号";
    "asset_equipment_serial_number" = "序列号";
    "asset_equipment_manufacture_date" = "出厂日期";
    "asset_equipment_installation_date" = "安装日期";
    "asset_equipment_commissiong_date" = "启用日期";
    "asset_equipment_weight" = "重量";
    "asset_equipment_age" = "寿命";
    "asset_equipment_desc" = "描述";
    
    
    "asset_parammeter_unit" = "单位";
    "asset_parameter_default" = "默认值";
    "asset_parammeter_desc" = "描述";
    "asset_no_data" = "当前没有符合条件的数据";
    
    
    "asset_life_span_unit" = "年";
    "asset_life_span_unit_multi" = "年";
    
    //报障
    "report_service_type" = "服务类型";
    "report_content" = "工作内容";
    "report_location" = "位置";
    "report_reporter" = "申请人";
    "report_org" = "部门";
    "report_telno" = "联系电话";
    "report_order_type" = "工单类型";
    "report_priority" = "优先级";
    
    "report_order_type_maintenance" = "纠正性维护";
    "report_order_type_self_check" = "自检";
    "report_order_type_mix" = "混合类型";
    
    "report_add_equipment" = "添加故障设备";
    "report_question_desc" = "问题描述";
    "report_request_reporter" = "未获取到报障人信息。";
    "report_request_service_type" = "请先选择服务类型。";
    "report_request_priority" = "请先选择优先级。";
    "report_request_phone" = "请先填写电话号码。";
    "report_upload_success" = "报障数据上传成功。";
    "report_upload_fail" = "报障数据上传失败。";
    "report_upload_fail_saved" = "数据上传失败,现保存到本地。";
    "report_upload_fail_un_saved" = "数据上传失败,数据保存中断。";
    "report_upload_fail_check_internet" = "数据上传失败，请检查数据是否正确，网络是否连接。";
    "report_equipment_exist" = "该设备已经存在。";
    "report_upload_no_data" = "暂无待上传报障记录";
    "report_noitce_delete_this" = "是否要删除本记录?";
    
    "report_my_no_data" = "暂无报障历史记录";
    "report_my_order_desc" = "工单描述";
    
    "report_baseInfo_header_title" = "基本信息";
    "report_device_header_title" = "故障设备";
    "report_description_header_title" = "问题描述";
    
    
    //服务台
    "requirement_status_create" = "已创建";
    "requirement_status_process" = "处理中";
    "requirement_status_finish" = "已完成";
    "requirement_status_evaluate" = "已评价";
    
    "requirement_origin_web" = "web";
    "requirement_origin_phone" = "手机";
    "requirement_origin_wechat" = "微信";
    "requirement_origin_email" = "邮件";
    
    "requirement_code" = "需求编号:";
    "requirement_origin" = "需求来源:";
    "requirement_requestor" = "需求人:";
    "requirement_phone" = "电话:";
    "requirement_desc" = "需求描述:";
    "requirement_type" = "需求类型:";
    
    "requirement_requestor_name" = "姓名:";
    "requirement_requestor_appellation" = "称谓:";
    "requirement_requestor_position" = "职位:";
    "requirement_requestor_org" = "部门:";
    "requirement_requestor_phone" = "电话:";
    "requirement_requestor_mobile" = "手机:";
    
    "requirement_requestor_format" = "%@ 创建于 %@";
    
    "requirement_satisfaction_title" = "满意度评价";
    "requirement_satisfaction" = "满意度";
    "requirement_evaluate_comment" = "评价内容:";
    
    "requirement_record_date_format" = "M月dd日";
    
    "requirement_create_order" = "生成工单";
    "requirement_pass" = "通过";
    
    "requirement_photo" = "图片";
    "requirement_audio" = "音频";
    "requirement_video" = "视频";
    
    "requirement_info" = "需求信息";
    "requirement_content" = "处理内容";
    "requirement_order" = "关联工单";
    "requirement_record" = "处理记录";
    "requirement_attachment" = "附件";
    
    "requirement_content_placeholder" = "在此填写处理内容:";
    
    
    //无数据显示
    "requirement_my_no_data" = "暂无需求记录";
    "requirement_evaluate_no_data" = "暂无待评价需求";
    "requirement_undo_no_data" = "暂无待处理需求";
    "requirement_approval_no_data" = "暂无待审批需求";
    
    "requirement_satisfaction_no_data" = "无满意度数据，请去离线中心下载或询问管理人员";
    
    
    
    "requirement_notice_reqtype" = "请选择需求类型";
    "requirement_notice_description" = "请填写需求描述";
    
    "requirement_upload_fail" = "数据上传失败,请检查你的网络";
    "requirement_upload_success" = "需求数据上传成功";
    "requirement_order_unfinished" = "该需求有工单未完成,请先完成工单。";
    
    "requirement_headlbl_picture" = "图片";
    "requirement_headlbl_audio" = "音频";
    "requirement_headlbl_video" = "视频";
    
    "requirement_req_person" = "联系人";
    "requirement_req_person_placeholder" = "请输入联系人姓名";
    "requirement_req_phone" = "联系电话";
    "requirement_req_phone_placeholder" = "请输入联系电话";
    "requirement_req_type" = "需求类型";
    "requirement_req_type_placeholder" = "请选择需求类型";
    "requirement_req_desc" = "需求描述";
    "requirement_req_desc_placeholder" = "请输入需求描述";
    "requirement_req_loaction" = "位置";
    
    "requirement_notice_person_empty" = "申请人不能为空";
    "requirement_notice_type_empty" = "需求类型不能为空";
    "requirement_notice_desc_empty" = "需求描述不能为空";
    "requirement_notice_vide_making_zip" = "视频文件正在压缩处理中，请稍候...";
    
    "requirement_voice_record_start" = "点击录音";
    
    "requirement_add_media_photo" = "图片";
    "requirement_add_media_camera" = "拍照";
    "requirement_add_media_voice" = "录音";
    "requirement_add_media_video" = "视频";
    
    
    "requirement_record_title_str_create" = "创建需求";
    "requirement_record_title_str_approval" = "审核";
    "requirement_record_title_str_order" = "创建工单";
    "requirement_record_title_str_process" = "跟进";
    "requirement_record_title_str_followup" = "回访";
    "requirement_record_title_str_finsih" = "结束";
    
    "requirement_evaluate_desc" = "描述";
    "requirement_evaluate_desc_placeholder" = "请输入描述";
    "requirement_evaluate_quality" = "服务质量";
    "requirement_evaluate_speed" = "服务速度";
    "requirement_evaluate_attitude" = "服务态度";
    
    "requirement_evaluate_failed" = "评价失败";
    "requirement_evaluate_success" = "评价成功";
    
    //库存
    "inventory_reserve_code" = "预定单号";
    "inventory_reserve_administrator" = "仓库管理员";
    "inventory_reserve_supervisor" = "审批主管";
    "inventory_reserve_person" = "预定人";
    "inventory_reserve_administrator_placeholder" = "点击选择仓库管理员";
    "inventory_reserve_supervisor_placeholder" = "点击选择审批主管";
    "inventory_reserve_person_placeholder" = "";
    
    
    "inventory_reserve_time" = "预定日期";
    "inventory_reserve_desc" = "备注";
    "inventory_reserve_material" = "物料";
    
    "inventory_reserve_code_colon" = "预定单号:";
    "inventory_reserve_person_colon" = "预定人:";
    "inventory_reserve_time_colon" = "预定日期:";
    "inventory_reserve_warehouse_colon" = "仓库名称:";
    "inventory_reserve_order_colon" = "关联工单:";
    "inventory_reserve_desc_colon" = "备注:";
    "inventory_reserve_material_colon" = "物料";
    
    "inventory_reserve_approval_type_undo" = "待审核";
    "inventory_reserve_approval_type_finish" = "已审核";
    
    "inventory_reserve_detail_operation_approval" = "审批";
    "inventory_reserve_detail_operation_delivery" = "出库";
    
    "inventory_reserve_detail_operation_approval_ok" = "通过";
    "inventory_reserve_detail_operation_approval_cancel" = "驳回";
    
    "inventory_btn_delivery" = "物资出库";
    "inventory_btn_stock_out" = "出库";
    "inventory_btn_cancel" = "取消出库";
    "inventory_btn_cancel_reservation" = "取消预定";
    "inventory_btn_reserve" = "预定";
    "inventory_btn_transfer" = "移库";
    "inventory_btn_add" = "添加";
    "inventory_btn_edit" = "修改";
    
    "inventory_receive_person" = "领用人";
    "inventory_receive_person_colon" = "领用人:";
    "inventory_receive_time" = "领用日期:";
    
    "inventory_approval_status_approvaling" = "待审核";
    "inventory_approval_status_success" = "待出库";
    "inventory_approval_status_fail" = "已驳回";
    "inventory_approval_status_finished" = "已出库";
    "inventory_reservation_status_cancel" = "取消出库";
    "inventory_reservation_status_cancel_reservation" = "取消预定";
    
    "inventory_no_data_history" = "暂无已审核记录";
    "inventory_no_data_approval" = "暂无待审核记录";
    "inventory_no_data_reserved" = "暂无预定记录";
    "inventory_no_data_reserve" = "暂无待审核记录";
    "inventory_cancel_success" = "取消出库成功。";
    "inventory_cancel_fail" = "取消出库失败。";
    "inventory_cancel_reservation_success" = "取消预定成功。";
    "inventory_cancel_reservation_fail" = "取消预定失败。";
    "inventory_reserve_success" = "库存预定成功。";
    "inventory_reserve_fail" = "库存预定失败。";
    "inventory_delivery_success" = "出库成功。";
    "inventory_delivery_fail" = "出库失败。";
    "inventory_transfer_success" = "移库成功。";
    "inventory_transfer_fail" = "移库失败。";
    "inventory_edit_handler_success" = "操作成功。";
    "inventory_edit_handler_fail" = "操作失败。";
    
    "inventory_in_stock" = "有库存";
    "inventory_no_stock" = "无库存";
    
    
    "inventory_notice_warehouse" = "请先选择一个仓库。";
    "inventory_notice_warehouse_src" = "请先选择一个仓库作为原仓库。";
    "inventory_notice_warehouse_target" = "请先选择一个仓库作为目标仓库。";
    "inventory_notice_administrator" = "请先选择一个仓库管理员。";
    "inventory_notice_administrator_src" = "请先选择原仓库管理员。";
    "inventory_notice_administrator_target" = "请先选择目标仓库管理员。";
    "inventory_notice_supervisor" = "请先选择一个主管。";
    "inventory_notice_reserving_person" = "请先选择一个预定人。";
    "inventory_notice_receiving_person" = "请先选择一个领用人。";
    "inventory_notice_no_person" = "暂无可选员工信息。";
    "inventory_notice_no_supervisor" = "暂无可选主管信息。";
    "inventory_notice_warehouse_src_target_same" = "原仓库同目标仓库相同。";
    "inventory_notice_material_delete" = "是否删除该物料，请确认。";
    "inventory_notice_material_delete_success" = "物料删除成功。";
    "inventory_notice_material_delete_fail" = "物料删除失败。";
    "inventory_notice_material" = "请添加物料。";
    "inventory_notice_material_out_empty" = "出库数量不能为空。";
    "inventory_notice_material_batch_empty" = "请添加批次";
    "inventory_notice_warehouse_using" = "当前仓库正在使用中，不可修改。";
    "inventory_notice_material_name_error" = "请先选择一个物料。";
    "inventory_notice_material_amount_error" = "预定数量不能为空或者负数，请确认。";
    "inventory_notice_delivery_amount_less_than_reserved" = "出库数量不能超过预定数量。";
    "inventory_notice_delivery_amount_less_than_batch" = "出库数量不能大于账面数量。";
    "inventory_notice_delivery_amount_less_than_realnumber" = "数量不能大于有效数量。";
    "inventory_notice_delivery_amount_less_than_totalnumber" = "数量不能大于账面数量。";
    
    "inventory_notice_material_no_right" = "抱歉，您对当前物资没有操作权限。";
    
    "inventory_notice_more_than_inventory" = "仓库中数量不足，请重新确认。";
    "inventory_notice_batch_empty" = "物资没有批次，不能盘点。";
    "inventory_notice_material_exist" = "物料已存在。";
    "inventory_notice_warehouse_amount" = "(提示:物料只能从一个仓库中添加)";
    "inventory_notice_delivery_receive_amount" = "请选择物料并填写出库数量。";
    "inventory_notice_shift_receive_amount" = "请选择物料并填写移库数量。";
    "inventory_notice_cancel_delivery_reason" = "请输入取消出库原因。";
    "inventory_notice_cancel_reservation_reason" = "请输入取消预定原因。";
    
    "inventory_notice_approval_pass_success" = "预定单已通过审批。";
    "inventory_notice_approval_pass_fail" = "请求失败。";
    "inventory_notice_approval_refuse_success" = "预定单已被驳回。";
    "inventory_notice_approval_refuse_fail" = "请求失败。";
    "inventory_notice_approval_empty" = "驳回原因不能为空。";
    
    "inventory_notice_delivery_success" = "出库成功。";
    "inventory_notice_delivery_fail" = "出库失败。";
    "inventory_notice_cancel_delivery_success" = "取消出库成功。";
    "inventory_notice_cancel_delivery_fail" = "取消出库失败。";
    
    
    "inventory_detail_base" = "基本信息";
    "inventory_detail_material" = "物料";
    "inventory_detail_order" = "关联工单";
    
    "inventory_detail_base_code_colon" = "预定单号:";
    "inventory_detail_base_warehouse_colon" = "仓库名称:";
    "inventory_detail_base_applicant_colon" = "预定人:";
    "inventory_detail_base_date_colon" = "预定时间:";
    "inventory_detail_base_order_colon" = "关联工单:";
    "inventory_detail_base_desc_colon" = "备注:";
    
    "inventory_detail_material_name_colon" = "物料名称:";
    "inventory_detail_material_brand_colon" = "品牌:";
    "inventory_detail_material_model_colon" = "型号:";
    "inventory_detail_material_count_reserved" = "预定x";
    "inventory_detail_material_count_received" = "实领x";
    "inventory_detail_material_cost_colon" = "费用(单价):";
    
    "inventory_detail_approval_title" = "审批预定";
    "inventory_detail_approval_desc_placeholder" = "请输入原因";
    "inventory_detail_delivery_title" = "确认出库";
    "inventory_detail_delivery_cancel_title" = "取消出库";
    "inventory_detail_delivery_count_colon" = "物资出库总量:";
    "inventory_detail_delivery_warehouse_colon" = "仓库名称:";
    "inventory_detail_delivery_applicant_colon" = "领料人:";
    "inventory_detail_delivery_date_colon" = "领料日期:";
    
    "inventory_material_title_add" = "添加物料";
    "inventory_material_title_edit" = "编辑物料";
    
    "inventory_material_code" = "编码";
    "inventory_material_name" = "名称";
    "inventory_material_brand" = "品牌";
    "inventory_material_model" = "型号";
    "inventory_material_amount" = "有效数量";
    "inventory_material_reserve_amount" = "预定数量";
    "inventory_material_reserve_cost" = "费用(单价)";
    
    "inventory_material_placeholder_code" = "点击选择物料";
    "inventory_material_placeholder_name" = "点击选择物料";
    "inventory_material_placeholder_brand" = "品牌";
    "inventory_material_placeholder_model" = "型号";
    "inventory_material_placeholder_amount" = "库存数量";
    "inventory_material_placeholder_reserve_amount" = "预定数量";
    "inventory_material_placeholder_reserve_cost" = "单价";
    
    
    "inventory_material_desc_name" = "物资名称：";
    "inventory_material_desc_code" = "物资编码：";
    "inventory_material_desc_warehouse" = "仓库名称：";
    "inventory_material_desc_brand" = "品牌：";
    "inventory_material_desc_model" = "型号：";
    "inventory_material_desc_dbcount" = "账面数量：";
    "inventory_material_desc_realnumber" = "有效数量：";
    "inventory_material_desc_count_in" = "入库数量：";
    "inventory_material_desc_check_number" = "盘点数量：";
    "inventory_material_desc_count_out" = "出库数量：";
    "inventory_material_desc_count_reserve" = "预定数量：";
    "inventory_material_desc_count_move" = "移库数量：";
    
    "inventory_material_desc_unit" = "单位：";
    "inventory_material_desc_deciding_price" = "核定价格(元)：";
    "inventory_material_desc_minnumber" = "最低库存量：";
    "inventory_material_desc_reservednumber" = "已预定数量：";
    "inventory_material_desc_notice" = "备注：";
    "inventory_material_desc_photo" = "图片：";
    "inventory_material_desc_attachment" = "附件：";
    "inventory_material_desc_provider" = "供应商：";
    "inventory_material_desc_ordercode" = "入库单号：";
    "inventory_material_desc_duetime" = "过期时间：";
    "inventory_material_desc_price" = "单价(元)：";
    "inventory_material_desc_amount" = "数量：";
    "inventory_material_desc_storage_amount" = "入库数量：";
    "inventory_material_desc_real_amount" = "账面数量：";
    "inventory_material_desc_storage_time" = "入库时间：";
    "inventory_material_desc_count_amount" = "盘点数量：";
    
    "inventory_provider_empty" = "暂无供应商信息";
    "inventory_warehouse_empty" = "暂无仓库信息";
    "inventory_no_data" = "暂无数据";
    "inventory_material_empty" = "暂无物资信息";
    "inventory_storage_out_empty" = "暂无出库信息";
    
    "inventory_material_section_title_detail" = "物资详情";
    "inventory_material_section_title_batch" = "入库批次";
    "inventory_material_section_title_record" = "当前物资记录";
    "inventory_material_section_title_batch_count" = "盘点批次";
    
    "inventory_material_check_upload_success" = "盘点数据上传成功";
    "inventory_material_check_upload_fail" = "盘点数据上传失败";
    "inventory_material_storage_success" = "入库成功";
    
    
    
    "inventory_material_batch_title" = "添加批次";
    "inventory_material_batch_title_edit" = "修改批次";
    "inventory_material_batch_provider" = "供应商";
    "inventory_material_batch_provider_placehoder" = "请选择供应商";
    "inventory_material_batch_duetime" = "过期时间";
    "inventory_material_batch_duetime_placehoder" = "请选择过期时间";
    "inventory_material_batch_price" = "单价(元)";
    "inventory_material_batch_price_placehoder" = "请输入单价";
    "inventory_material_batch_amount" = "数量";
    "inventory_material_batch_amount_placehoder" = "数量不能低于零";
    
    "inventory_query_condition_param_placehoder" = "请输入物资名称";
    
    "inventory_query_filter_empty" = "不限";
    "inventory_query_filter_enough" = "充足";
    "inventory_query_filter_lack" = "紧缺";
    
    "inventory_query_filter_header_name" = "物资名称";
    "inventory_query_filter_header_amount" = "库存量";
    
    "inventory_code_error" = "物资二维码不存在或匹配出错";
    "inventory_detail_request_failed" = "物资详情获取失败";
    
    "inventory_query_warehouse_name" = "仓库名称：";
    "inventory_query_admin" = "管理员：";
    "inventory_query_location" = "仓库位置：";
    "inventory_query_category" = "物资种类：";
    "inventory_query_amount" = "物资总量：";
    
    //出库
    "inventory_out_type_reservation" = "预定出库";
    "inventory_out_type_direct" = "直接出库";
    "inventory_out_header_warehouse" = "仓库名称";
    "inventory_out_header_material" = "物料";
    
    "inventory_out_detail_header_material" = "物料信息";
    "inventory_out_detail_header_reserved_amount" = "预定数量:";
    
    "inventory_out_detail_header_batch" = "出库批次";
    "inventory_out_detail_header_batch_amount" = "出库数量:";
    "inventory_shift_detail_header_batch" = "移库批次";
    "inventory_shift_detail_header_batch_amount" = "移库数量:";
    
    
    "inventory_out_detail_batch_provider" = "供应商:";
    "inventory_out_detail_batch_date" = "入库时间:";
    "inventory_out_detail_batch_due_date" = "过期时间:";
    "inventory_out_detail_batch_price" = "单价:";
    "inventory_out_detail_batch_inventory_amount" = "账面数量:";
    "inventory_out_detail_batch_amount" = "出库数量:";
    
    "inventory_out_detail_batch_amount_edit_title" = "修改数量";
    "inventory_out_detail_batch_amount_edit_placeholder" = "请输入出库数量";
    
    "inventory_out_administrator" = "仓库管理员";
    "inventory_out_administrator_placeholder" = "点击选择仓库管理员";
    "inventory_out_supervisor" = "主管";
    "inventory_out_supervisor_placeholder" = "点击选择主管";
    "inventory_out_person" = "领用人";
    "inventory_out_person_placeholder" = "点击选择领用人";
    "inventory_reservation_person" = "预定人";
    "inventory_reservation_person_placeholder" = "点击选择预定人";
    
    //移库
    "inventory_transfer_warehouse_src_desc" = "原仓库";
    "inventory_transfer_warehouse_src_desc_placeholder" = "点击选择仓库";
    "inventory_transfer_warehouse_target_desc" = "目标仓库";
    "inventory_transfer_warehouse_target_desc_placeholder" = "点击选择仓库";
    
    "inventory_transfer_administrator_src" = "原仓库管理员";
    "inventory_transfer_administrator_src_placeholder" = "点击选择原仓库管理员";
    "inventory_transfer_administrator_target" = "目标仓库管理员";
    "inventory_transfer_administrator_target_placeHolder" = "点击选择目标仓库管理员";
    
    //能源管理
    "energy_cycle_other" = "其它";
    "energy_cycle_month" = "一月一次";
    "energy_no_data" = "暂无任务";
    "energy_status_finished" = "已完成";
    "energy_status_unfinished" = "未完成";
    "energy_notice_no_need_submit" = "当前没有需要提交的数据。";
    "energy_task_cycle" = "任务周期:";
    "energy_task_lastTime" = "上次提交:";
    "energy_task_location" = "位置:";
    "energy_task_finish_time" = "完成时间:";
    "energy_task_content_title" = "抄表项";
    
    "energy_task_notice_unfinish" = "有未完成的任务";
    
    
    "energy_parameter_read" = "请输入抄表值:";
    "energy_parameter_unit" = "单位:";
    "energy_parameter_input_empty" = "抄表值不能为空";
    
    //修改密码
    "password_old_value" = "原密码:";
    "password_new_value" = "新密码:";
    "password_new_value_confirm" = "确认密码:";
    "password_notice_empty" = "密码不能为空。";
    "password_notice_no_need_change" = "新密码跟旧密码一样，不用修改";
    "password_notice_not_the_same" = "两次输入的密码不一致。";
    "password_reset_success" = "恭喜您，密码修改成功。";
    "password_reset_fail" = "很抱歉，密码修改失败。";
    "password_reset_fail_note_value" = "密码修改失败，请确认密码是否输入正确。";
    
    //上传
    "upload_waitting" = "等待上传";
    "upload_uploading" = "上传中...";
    "upload_success" = "上传成功";
    "upload_fail" = "上传失败";
    "upload_notice_uploading" = "当前正在上传中,请稍后...";
    
    //离线下载
    "download_un_downloaded" = "待下载";
    "download_downloading" = "下载中";
    "download_success" = "下载成功";
    "download_fail" = "下载失败";
    "download_need_download" = "待下载";
    "download_need_update" = "待更新";
    "download_downloaded" = "已下载";
    "download_no_data" = "无数据";
    "download_notice_download" = "获取数据失败，请先到离线下载部分下载基础数据。";
    "download_notice_not_need_update" = "当前没有需要更新的数据。";
    "download_notice_downloading" = "正在下载中...";
    "download_device" = "设备信息";
    "download_device_type" = "设备类型信息";
    "download_location" = "位置信息";
    "download_org" = "部门信息";
    "download_priority" = "优先级信息";
    "download_flow" = "工作流程信息";
    "download_service_type" = "服务类型信息";
    "download_requirement_type" = "需求类型信息";
    "download_satisfaction" = "满意度信息";
    "download_all" = "一键下载";
    "download_downloading_format" = "下载中 %.1f%@";
    
    //意见反馈
    "feedback_placeholder" = "您留下的每个字都将帮助改善我们的产品，期待您的反馈！\n(内容不少于5个字)";
    "feedback_notice_input" = "请先填写反馈信息。";
    "feedback_notice_input_mincount" = "内容不能少于%d个字。";
    "feedback_success" = "谢谢您的宝贵意见。";
    "feedback_fail" = "很抱歉，反馈信息提交失败。";
    
    //关于
    "about_company_name" = "上海费哲 版权所有";
    
    //
    "setting_notice_cache_size" = "检测到可以清除的缓存的大小为%@，是否立即清除?";
    "setting_notice_cache_size_ok" = "检测到当前缓存大小为%@，暂时不用清除。";
    
    //缓存
    "cache_clear" = "清除";
    "cache_item_file" = "清除临时文件";
    "cache_item_base_data" = "清除基础离线数据";
    "cache_item_patrol" = "清除巡检任务";
    "cache_item_preference" = "清除基础设置";
    "cache_item_message" = "清除推送消息记录";
    "cache_notice_select_none" = "请先选择需要清除的数据项。";
    "cache_notice_clear_success" = "缓存清除完成。";
    "cache_notice_clear_failed" = "缓存清除失败。";
    "cache_notice_clear_text" = "清除所选缓存数据，请确认。";
    
    //绑定手机号
    "bind_phone_info" = "手机号:";
    "bind_btn_bind" = "验证";
    "bind_notice_telno_error" = "输入的手机号码格式不正确, 请重新输入。";
    "bind_notice_telno_empty" = "手机号不能为空。";
    "bind_notice_input" = "请输入一个手机号。";
    "bind_notice_success" = "恭喜您，验证通过，手机号绑定成功。";
    "bind_notice_telno_inuse" = "该手机号已经被绑定。";
    "bind_notice_verify" = "请先获取验证码。";
    "bind_notice_verify_fail" = "手机验证失败。";
    "bind_phone_old_telno" = "您的旧手机号码 ";
    "bind_phone_request_code" = "获取验证码";
    "bind_phone_input_new_telno" = "请输入新手机号码";
    "bind_phone_input_telno" = "请输入手机号码";
    "bind_phone_input_code" = "请输入验证码";
    
    "user_photo_set_notice_null" = "请先选择一张照片。";
    
    //图表
    "chart_no_data" = "暂无数据";
    "chart_today" = "今日概况";
    "chart_order_today" = "今日工单概况";
    "chart_complain_unfinished" = "未处理投诉";
    "chart_complain_total" = "投诉总数";
    "chart_patrol_today" = "今日巡检";
    "chart_order_unfinished" = "未完成工单";
    "chart_order_total" = "所有工单";
    "chart_reported" = "已报修";
    "chart_exception_patrol" = "已报修";
    "chart_type_other" = "其它";
    "chart_type_report" = "报障";
    
    "chart_title_today_order" = "今日工单";
    "chart_desc_finish_all" = "完成/总数";
    
    "chart_type_process" = "处理";
    "chart_type_dispatch" = "派工";
    "chart_type_validate" = "审核";
    
    "chart_type_complain" = "投诉";
    "chart_type_order" = "工单";
    "chart_type_inspection" = "巡检";
    
    
    
    "chart_order_today_title" = "今日工单分析";
    "chart_order_currently_title" = "近7日工单完成情况";
    "chart_order_finished_amount" = "完成量";
    "chart_order_total_amount" = "工单量";
    
    "chart_order_total_count" = "工单总数(完成/未完成)";
    
    "chart_order_monthly" = "每月工单";
    
    "chart_requirement" = "需求分析";
    
    "chart_emergency" = "紧急事件";
    "chart_due_remind" = "到期提醒";
    "chart_msg_no_data" = "暂无消息记录";
    
    //消息
    "chart_message_work_order" = "工";
    "chart_message_inspection" = "巡";
    "chart_message_asset" = "资";
    "chart_message_maintenance" = "维";
    
    "chart_message_content_pai" = "[工单]您有一个工单待派工";
    "chart_message_content_gong" = "[工单]您有一个工单待处理";
    "chart_message_content_ting" = "[工单]您有一个工单被暂停";
    "chart_message_content_sheng" = "[工单]您有一个工单待审核";
    "chart_message_content_wan" = "[工单]您有一个工单已完成";
    "chart_message_content_yan" = "[工单]您有一个工单已验证";
    "chart_message_content_zhong" = "[工单]您有一个工单已终止";
    "chart_message_content_cun" = "[工单]您有一个工单已存档";
    
    //
    "service_type" = "服务类型";
    
    //上传下载
    "data_submit_finished" = "数据上传完成。";
    "data_submit_success" = "数据上传成功。";
    "data_submit_fail" = "数据上传失败。";
    "image_submit_success" = "图片上传成功。";
    "image_submit_fail" = "图片上传失败。";
    "file_submit_success" = "文件上传成功。";
    "file_submit_fail" = "文件上传失败。";
    
    //提示
    "notice_photo_delete" = "是否删除该图片，请选择。";
    "notice_audio_delete" = "是否删除该音频文件，请选择。";
    "notice_video_delete" = "是否删除该视频文件，请选择。";
    "notice_equipment_delete" = "是否删除该设备,请选择。";
    "notice_tool_delete" = "是否删除该工具,请选择。";
    "notice_function_developing" = "功能开发中，敬请期待...";
    "notice_device_not_support" = "设备不支持拍照";
    "notice_delete_done" = "确认";
    "notice_delete_cancel" = "取消";
    
    //签名
    "signature_notice_desc" = "签字";
    "signature_button_cancel" = "取消";
    "signature_button_done" = "签字通过";
    
    //通知
    "notification_notify_process" = "收到一条新的任务信息，是否现在处理?";
    "notification_notify_other_project" = "收到一条来自其它项目的任务。";
    "notification_notice_setting" = "如果你要关闭或开启%@的新消息通知，请在设备的 \"设置\" - \"通知\" 功能中，找到应用程序 \"%@\" 进行修改。";
    "notification_status_on" = "已开启";
    "notification_status_off" = "未开启";
    "notification_download_new" = "有新的离线下载";
    
    
    //net
    "net_error_request_fail" = "获取数据出错，请重新尝试。";
    "net_need_relogin" = "登陆超时，请重新登陆。";
    "net_login_fail" = "很抱歉，登陆失败。";
    "net_setting" = "网络设置";
    "net_notice_connect_fail" = "网络连接失败,是否现在进行设置?";
    "net_btn_set_now" = "现在设置";
    "net_reachable_fail" = "网络连接失败。";
    
    //二维码
    "qrcode_notice" = "将二维码放入框内，即可自动扫描";
    "qrcode_notice_wait" = "正在加载...";
    "qrcode_notice_permission" = "打开摄像头失败，请先检查应用权限设置。";
    "qrcode_notice_not_valid" = "二维码匹配错误，请重新确认";
    
    //UITableViewCell
    "cell_show_more_detail" = "立即查看";
    "cell_show_all_detail" = "查看全部";
    
    //引导页
    "introduce_txt_first" = "guide_01_txt";
    "introduce_txt_second" = "guide_02_txt";
    "introduce_txt_third" = "guide_03_txt";
    "introduce_txt_fourth" = "guide_04_txt";
    
    "introduce_img_first" = "guide_01_bg";
    "introduce_img_second" = "guide_02_bg";
    "introduce_img_third" = "guide_03_bg";
    "introduce_img_fourth" = "guide_04_bg";
    
    //工单查询筛选
    "filter_header_title_priority" = "优先级";
    "filter_header_title_status" = "状态";
    "filter_no_limits" = "不限";
    
    //提示Tips
    "tips_title" = "提示";
    
    "tips_select_actualarrival_time" = "请选择实际完成时间";
    "tips_setted_ok" = "设置成功";
    "tips_setted_failed" = "设置失败，请检查你的网络";
    
    "tips_description_empty" = "描述不能为空";
    
    "tips_confirm_finished" = "请确认是否完成";
    "tips_operate_success" = "操作成功";
    "tips_operate_failed" = "操作失败，请检查你的网络";
    
    "tips_tools_add_success" = "添加工具成功";
    "tips_tools_modify_success" = "修改工具成功";
    "tips_tools_delete_success" = "删除工具成功";
    "tips_tools_failed" = "操作失败。";
    
    "tips_charge_add_success" = "添加收费成功";
    "tips_charge_modify_success" = "修改收费成功";
    "tips_charge_delete_success" = "删除收费成功";
    "tips_charge_failed" = "操作失败。";
    "tips_charge_notice_input" = "请检查收费项详情";
    
    
    "tableviewcell_delete" = "删除";
    "tableviewcell_mark_readed" = "标记已读";
    "tableviewcell_mark_more" = "更多";
    
    "message_controller_menu_allread" = "全部已读";
    "message_controller_menu_alldelete" = "全部删除";
    
    //信息选择
    "filter_placeholder_common" = "请输入过滤条件";
    
    //输入限制
    "base_text_view_limited" = "最多可以输入%ld个字";
    "base_text_view_full" = "已满%ld字";
    
    //收费项明细修改
    "work_order_charge_modify" = "修改收费项";
    
    //ppm详情
    "ppm_status_current_month" = "当月任务";
    "ppm_status_current_day" = "当天任务";
    "ppm_status_finished" = "已完成";
    "ppm_status_missed" = "遗漏";
    "ppm_status_undo" = "未开始";
    "ppm_status_process" = "处理中";
    
    "ppm_planned_maintain_time" = "维护时间:";
    "ppm_work_order" = "工单";
    
    
    //资产管理模块
    "asset_detail_no_data" = "二维码匹配错误，请重新确认";
    
    "asset_manage_profile" = "设备总数%ld个，设备分类%ld种，保养计划%ld种。";
    
    "asset_header_title_profile" = "资产概况";
    "asset_header_title_equipment" = "设备列表";
    
    "asset_equipment_query" = "设备查询";
    "asset_equipment_detail" = "设备信息";
    
    "contract_target" = "合同信息";
    "equipment_target" = "设备信息";
    "factory_target" = "厂家信息";
    "fixed_target" = "维修记录";
    "maintain_target" = "维保记录";
    
    "navi_title_contract_target" = "合同信息";
    "navi_title_equipment_target" = "设备信息";
    "navi_title_factory_target" = "厂家信息";
    "navi_title_fixed_target" = "维修记录";
    "navi_title_maintain_target" = "维保记录";
    
    "System_classification" = "系统分类:";
    "Installation_location" = "安装位置:";
    
    
    "equipment_number" = "设备编号:";
    "equipment_name" = "设备名称:";
    "equipment_classification" = "系统分类:";
    "equipment_status" = "设备状态:";
    "equipment_location" = "安装位置:";
    "equipment_brand" = "品牌:";
    "equipment_model" = "型号:";
    "equipment_count" = "数量:";
    "equipment_unit" = "单位:";
    "equipment_brand_location" = "铭牌位置:";
    "equipment_product_location" = "产地:";
    "equipment_serialnumber" = "序列号:";
    "equipment_exfactorydate" = "出厂日期:";
    "equipment_installdate" = "安装日期:";
    "equipment_introductiondate" = "启用日期:";
    "equipment_transfer_date" = "移交日期:";
    "equipment_death_date" = "报废日期:";
    "equipment_design_life" = "设计年限:";
    "equipment_expectLife_date" = "预期年限:";
    "equipment_weight" = "重量:";
    "equipment_lifespan" = "寿命:";
    "equipment_list" = "清单:";
    "equipment_description" = "描述:";
    
    
    "equipment_header_title_baseinfo" = "基本信息";
    "equipment_header_title_picture" = "图片";
    "equipment_header_title_paremeter" = "参数信息";
    "equipment_header_title_area" = "服务区域";
    "equipment_header_title_contract_fixed" = "维修合同";
    "equipment_header_title_contract_maintain" = "维保合同";
    "equipment_header_title_contract_other" = "其他合同";
    
    "equipment_header_title_manufactory" = "生产商:";
    "equipment_header_title_provider" = "供应商:";
    "equipment_header_title_installer" = "安装单位:";
    
    "equipment_header_title_contract_fixed" = "维修合同";
    "equipment_header_title_contract_maintain" = "维保合同";
    
    
    "asset_paremeter_name" = "参数名称:";
    "asset_paremeter_default_value" = "默认值:";
    "asset_paremeter_unit" = "单位:";
    "asset_paremeter_desc" = "描述:";
    
    
    "asset_contract_code" = "合同编号:";
    "asset_contract_guarantor" = "保修单位:";
    "asset_contract_startdate" = "开始时间:";
    "asset_contract_stopdate" = "到期时间:";
    "asset_contract_amount" = "合同金额:";
    "asset_contract_description" = "合同简介:";
    
    "asset_factory_contact" = "联系人:";
    "asset_factory_phone" = "电话:";
    "asset_factory_address" = "地址:";
    
    "asset_record_fixed_none" = "暂无维修记录";
    "asset_record_maintain_none" = "暂无维保记录";
    "asset_record_contract_none" = "暂无合同信息";
    "asset_record_factory_none" = "暂无厂家信息";
    
    "asset_order_record_applicant" = "申请人:";
    "asset_order_record_location" = "位置:";
    
    "asset_filter_code" = "设备编码";
    "asset_filter_base_info" = "基本信息";
    "asset_filter_location" = "安装位置";
    "asset_filter_classification" = "系统分类";
    "asset_filter_status" = "设备状态";
    
    "asset_no_match_notice" = "当前项目没有该设备信息，请重新确认";
    
    "textfield_placeholder_code" = "请输入设备编码";
    "textfield_placeholder_baseinfo" = "请输入名称/品牌/型号";
    "textfield_placeholder_location" = "请输入安装位置";
    "textfield_placeholder_classification" = "请输入分类名称";
    
    
    
    //在岗管理
    "attendance_person_status_in" = "在岗";
    "attendance_person_status_out" = "离开";
    "attendance_navigation_title_sign" = "签到";
    "attendance_navigation_title_setting" = "签到设置";
    
    "attendance_tabbar_btn_sign" = "签到";
    "attendance_tabbar_btn_setting" = "设置";
    
    "attendance_time_type_sign_IN" = "签入时间";
    "attendance_time_type_sign_OUT" = "签出时间";
    
    "attendance_sign_type_sign_IN" = "签入";
    "attendance_sign_type_sign_OUT" = "签出";
    
    "attendance_setting_employee" = "签到人员";
    "attendance_setting_location" = "签到地理位置";
    "attendance_setting_WiFi" = "签到 Wi-Fi";
    "attendance_setting_bluetooth" = "签到蓝牙";
    "attendance_setting_status_enable" = "启用";
    "attendance_setting_status_unable" = "禁用";
    
    "attendance_setting_employee_add" = "添加人员";
    "attendance_notice_employee_add_empty" = "请至少添加一个员工。";
    "attendance_notice_employee_add_new" = "请添加新员工。";
    "attendance_notice_employee_add_success" = "执行人添加成功。";
    "attendance_notice_employee_add_fail" = "执行人添加失败。";
    "attendance_setting_employee_delete_success" = "执行人删除成功。";
    "attendance_setting_employee_delete_fail" = "执行人删除失败。";
    
    "attendance_notice_no_employee" = "暂无需要签到人员。";
    
    "attendance_sign_WiFi_within" = "已进入WiFi签到范围: %@";
    "attendance_sign_BLE_within" = "已进入蓝牙签到范围: %@";
    "attendance_sign_GPS_within" = "已进入GPS签到范围: %@";
    
    "attendance_sign_leave" = "允许签出";
    "attendance_sign_forbidden" = "当前不可签到";
    
    "attendance_sign_fail_in" = "签入失败";
    "attendance_sign_fail_out" = "签出失败";
    
    
    "attendance_notice_no_employee" = "暂无需要签到人员";
    "attendance_notice_no_location" = "暂无位置信息";
    "attendance_notice_no_wifi" = "暂无wifi信息";
    "attendance_notice_no_bluetooth" = "暂无蓝牙信息";
    
    "attendance_notice_wifi_add_header" = "可能需要的 Wi-Fi";
    "attendance_notice_wifi_add_empty" = "请至少添加一个 Wi-Fi。";
    "attendance_notice_wifi_add_using" = "当前所选 Wi-Fi 正在使用中，请重新选择。";
    "attendance_setting_wifi_add" = "添加 Wi-Fi";
    "attendance_setting_wifi_add_success" = "添加 Wi-Fi 成功。";
    "attendance_setting_wifi_add_fail" = "添加 Wi-Fi 失败。";
    "attendance_setting_wifi_delete_success" = "Wi-Fi 删除成功。";
    "attendance_setting_wifi_delete_fail" = "Wi-Fi 删除失败。";
    "attendance_setting_wifi_update_success" = "Wi-Fi 状态修改成功。";
    "attendance_setting_wifi_update_fail" = "Wi-Fi 状态修改失败。";
    
    "attendance_notice_bluetooth_add_header" = "可能需要的蓝牙";
    "attendance_notice_bluetooth_add_empty" = "请至少添加一个蓝牙地址。";
    "attendance_notice_bluetooth_add_using" = "当前所选蓝牙正在使用中，请重新选择。";
    "attendance_setting_bluetooth_add" = "添加蓝牙";
    "attendance_setting_bluetooth_add_success" = "添加蓝牙成功。";
    "attendance_setting_bluetooth_add_fail" = "添加蓝牙失败。";
    "attendance_setting_bluetooth_delete_success" = "蓝牙 删除成功。";
    "attendance_setting_bluetooth_delete_fail" = "蓝牙 删除失败。";
    "attendance_setting_bluetooth_update_success" = "蓝牙 修改成功。";
    "attendance_setting_bluetooth_update_fail" = "蓝牙 修改失败。";
    
    "attendance_notice_location_add_header" = "搜索地点";
    "attendance_notice_location_add_empty" = "请至少添加一个地址。";
    "attendance_notice_location_add_using" = "当前所选位置正在使用中，请重新选择。";
    "attendance_setting_location_add" = "添加位置";
    "attendance_setting_location_notice_pick_accuracy" = "选择有效范围";
    "attendance_setting_location_add_success" = "添加位置成功。";
    "attendance_setting_location_add_fail" = "添加位置失败。";
    "attendance_setting_location_delete_success" = "位置删除成功。";
    "attendance_setting_location_delete_fail" = "位置删除失败。";
    "attendance_setting_location_update_success" = "位置修改成功。";
    "attendance_setting_location_update_fail" = "位置修改失败。";
    
    "attendance_setting_location_update_success" = "位置状态修改成功。";
    "attendance_setting_location_update_failed" = "位置状态修改失败。";
    
    "attendance_setting_employee_title" = "签到人员(%ld人)";
    "attendance_setting_location_title" = "签到地理位置";
    "attendance_setting_wifi_title" = "签到WiFi";
    "attendance_setting_bluetooth_title" = "签到Bluetooth";
    
    "attendance_setting_configuration_enable" = "启用";
    "attendance_setting_configuration_disable" = "禁用";
    
    "attendance_getting_setting_configuration_fail" = "获取签到设置信息失败";
    
    "attendance_sign_in" = "入";
    "attendance_sign_out" = "出";
    
    "attendance_location_fail" = "定位失败";
    "attendance_location_search_placeholder" = "搜索地点";
    
    //合同
    "contract_status_undo" = "未开始";
    "contract_status_executing" = "执行中";
    "contract_status_expired" = "已到期";
    "contract_status_verfied_NO" = "验收不通过";
    "contract_status_verfied_YES" = "验收通过";
    "contract_status_terminated" = "已终止";
    "contract_status_closed" = "已存档";
    "contract_status_verfied" = "已验收";
    
    "contract_op_status_create" = "创建";
    "contract_op_status_close" = "终止";
    "contract_op_status_expired" = "恢复";
    "contract_op_status_verfied_NO" = "验收不通过";
    "contract_op_status_verfied_YES" = "验收通过";
    "contract_op_status_archived" = "存档";
    "contract_op_status_update" = "更新";
    
    "contract_management_title" = "合同管理";
    
    "contract_operate_pass" = "通过";
    "contract_operate_unpass" = "不通过";
    
    "contract_payment_in" = "收";
    "contract_payment_out" = "付";
    
    "contract_cost_type_transfer" = "转账";
    "contract_cost_type_cash" = "现金";
    "contract_cost_type_draft" = "汇票";
    
    "contract_filter_header_title_code" = "合同编号";
    "contract_filter_header_title_code_placeholder" = "请输入编号";
    "contract_filter_header_title_cost_type" = "支付类型";
    "contract_filter_header_title_status" = "合同状态";
    
    "contract_query_no_data" = "暂无数据";
    
    "contract_time_life" = "起止日期:";
    "contract_category" = "分类:";
    
    "contract_detail_request_fail" = "合同详情查询失败。";
    "contract_statistics_request_fail" = "合同统计信息查询失败。";
    
    
    "contract_amount_total" = "合同总数";
    "contract_amount_payment" = "付款合同";
    "contract_amount_receivable" = "收款合同";
    
    "contract_currency_type_yuan" = "元";
    "contract_currency_type_dollar" = "美元";
    
    "contract_detail_operate_title" = "操作";
    "contract_detail_operate_close" = "终止";
    "contract_detail_operate_check" = "验收";
    "contract_detail_operate_archived" = "存档";
    "contract_detail_operate_recovery" = "恢复";
    
    "contract_detail_operate_title_close" = "合同终止";
    "contract_detail_operate_title_recovery" = "合同恢复";
    "contract_detail_operate_title_check" = "合同验收";
    "contract_detail_operate_title_archived" = "合同存档";
    
    
    "contract_record_detail_title" = "合同操作记录";
    "contract_equipment_detail_title" = "合同关联设备";
    
    "contract_detail_header_title_profile" = "基本信息";
    "contract_detail_header_title_record" = "操作记录";
    "contract_detail_header_title_equipment" = "关联设备";
    
    "contract_detail_baseinfo_title_name" = "合同名称：";
    "contract_detail_baseinfo_title_category" = "合同分类：";
    "contract_detail_baseinfo_title_money" = "合同金额：";
    "contract_detail_baseinfo_title_paymethod" = "支付方式：";
    "contract_detail_baseinfo_title_signdate" = "签订日期：";
    "contract_detail_baseinfo_title_clerk" = "业务员：";
    "contract_detail_baseinfo_title_department" = "所属部门：";
    "contract_detail_baseinfo_title_duedate" = "起止日期：";
    "contract_detail_baseinfo_title_partyA" = "合同甲方：";
    "contract_detail_baseinfo_title_partyACharge" = "甲方负责人：";
    "contract_detail_baseinfo_title_partyB" = "合同乙方：";
    "contract_detail_baseinfo_title_partyBCharge" = "乙方负责人：";
    "contract_detail_baseinfo_title_content" = "合同主要内容：";
    "contract_detail_baseinfo_title_attachment" = "合同附件：";
    
    "contract_equipment_title_location" = "安装位置：";
    
    //公告
    "function_notice" = "公告";
    
    "bulletin_notice_read" = "已读";
    "bulletin_notice_unread" = "未读";
    
    "bulletin_notice_read_count" = "已读(%d)";
    "bulletin_notice_unread_count" = "未读(%d)";
    
    "bulletin_history_request_failed" = "公告信息获取失败";
    "bulletin_history_no_data" = "暂无历史公告";
    "bulletin_history_no_data_unreaded" = "暂无未读公告";
    "bulletin_history_no_data_readed" = "暂无已读公告";
    "bulletin_history_creator" = "作者";
    "bulletin_detail_read_state" = "%ld人已读，%ld人未读";
    
    "bulletin_top" = "置顶";
    
    "bulletin_grade_type_project" = "项目级";
    "bulletin_grade_type_company" = "公司级";
    "bulletin_grade_type_system" = "系统级";
    
    "bulletin_detail_no_data" = "公告获取失败";
    
    "bulletin_read_unread_list" = "公告接收列表";
    "bulletin_reader_no_data" = "暂无数据";
    
    
    //2017-3-7
    //我的签到记录
    "my_attendance_record_name" = "签到值班员：";
    "my_attendance_record_location" = "签到位置：";
    "my_attendance_record_time" = "签到时间：";
    "my_attendance_record_no_data" = "暂无签到记录";
    
    //我的二维码
    "my_qrcode_describe" = "扫描我可进行签到";
    
    //核心组件
    "core_component_base_info_code" = "编码：";
    "core_component_base_info_name" = "名称：";
    "core_component_base_info_brand" = "品牌：";
    "core_component_base_info_model" = "型号：";
    "core_component_base_info_period" = "质保期：";
    "core_component_base_info_installDate" = "安装日期：";
    "core_component_base_info_expireDate" = "质保日期：";
    "core_component_base_info_replaceDate" = "被替换日期：";
    
    "core_component_record_code" = "设备编码：";
    "core_component_record_handler" = "操作人：";
    "core_component_record_operatetime" = "操作时间：";
    "core_component_record_brand" = "品牌：";
    "core_component_record_model" = "型号：";
    "core_component_record_period" = "质保周期：";
    "core_component_record_installdate" = "安装时间：";
    "core_component_record_expireddate" = "质保到期：";
    
    "core_component_navi_title" = "核心组件详情";
    
    "core_component_replace_no" = "更换前";
    "core_component_replace_yes" = "更换后";
    
    "core_component_section_baseinfo" = "基本信息";
    "core_component_section_replace_record" = "设备更换记录";
    
    "patrol_target" = "巡检记录";
    "core_component_target" = "核心组件";
    
    "navi_title_patrol" = "巡检记录";
    "navi_title_core_component" = "核心组件";
    
    "asset_record_patrol_none" = "暂无巡检记录";
    "asset_record_core_component_none" = "暂无核心组件";
    
    //资产详情
    "equipment_header_title_undo_patrol" = "待处理巡检任务";
    "equipment_header_title_undo_workorder" = "待处理工单";
    "equipment_header_btn_undo_patrol_syn" = "同步";
    
    
    //快速报障
    "quick_report_navi_title" = "快速报障";
    
    "function_quick_report" = "快速报障";
    
    "quick_report_section_title_baseinfo" = "基本信息";
    "quick_report_section_title_equipment" = "故障设备";
    "quick_report_section_title_audio" = "语音";
    "quick_report_section_title_photo" = "图片";
    "quick_report_section_title_video" = "视频";
    "quick_report_section_title_desc" = "故障描述";
    
    "quick_report_equipment_code" = "设备编码：";
    "quick_report_equipment_name" = "设备名称：";
    "quick_report_equipment_location" = "站点：";
    
    //需求详情
    "requirement_location" = "站点:";
    "requirement_section_title_equipment" = "故障设备";
    
    //flynn 2017-03-08
    "order_equipment_status_placeholder" = "点击选择设备状态";
    "order_equipment_repair_type_placeholder" = "点击选择维修类型";
    "order_equipment_header_core" = "核心组件";
    
    //2017-3-9
    "function_scanner" = "扫一扫";
    
    //flynn 2017-03-10
    "order_equipment_component_replace" = "核心组件更换";
    "order_equipment_component_operation_replace" = "更换";
    "order_equipment_component_notice_code_empty" = "编号不能为空";
    "order_equipment_component_notice_name_empty" = "名称不能为空";
    
    "asset_core_component_code" = "编码";
    "asset_core_component_code_placeholder" = "请输入编码";
    "asset_core_component_name" = "名称";
    "asset_core_component_name_placeholder" = "请输入名称";
    "asset_core_component_brand" = "品牌";
    "asset_core_component_brand_placeholder" = "请输入品牌";
    "asset_core_component_model" = "型号";
    "asset_core_component_model_placeholder" = "请输入型号";
    "asset_core_component_period" = "质保期";
    "asset_core_component_period_desc" = "(单位:月)";
    "asset_core_component_period_placeholder" = "请输入质保期";
    "asset_core_component_install_date" = "安装日期";
    "asset_core_component_install_date_placeholder" = "请选择安装日期";
    "asset_core_component_expired_date" = "质保日期";
    "asset_core_component_expired_date_placeholder" = "请选择质保日期";
    
    //flynn 2017-03-12
    "patrol_task_type_inspection" = "巡检";
    "patrol_task_type_patrol" = "巡视";
    
    //flynn 2017-03-13
    "common_base_data_notice_need_update" = "发现需要更新的数据包，现在开始更新。";
    "common_base_data_notice_downloading" = "正在下载基础数据，请稍后。";
    
    //jonzzs 2017-03-14
    "attendance_success" = "签到成功";
    "attendance_faile" = "签到失败，请检查你的网络。";
    "attendance_not_station" = "非车站值班人员";
    "attendance_not_outsource" = "非委外人员";
    "attendance_qrcode_error" = "二维码有误";
    
    //flynn 2017-03-16
    "info_select_failurereason" = "选择故障原因";
    "attendance_notice_need_check" = "请先签到再处理任务。";
    
    "about_us_version_beta" = "测试版";
    
    //jonzzs 2017-03-28
    "report_request_location" = "请填写位置信息。";
    "report_request_description" = "请填写故障描述。";
}


